Revit 2027 API
ParameterTypeId.JoistSystemNewBeamTypeNoFamNameParam Property
 "Beam Type (No Family Name)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId JoistSystemNewBeamTypeNoFamNameParam { get; }
Public Shared ReadOnly Property JoistSystemNewBeamTypeNoFamNameParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ JoistSystemNewBeamTypeNoFamNameParam {
	ForgeTypeId^ get ();
}
static member JoistSystemNewBeamTypeNoFamNameParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace